<html > 
<head><title>1  </title> 
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1"> 
<meta name="generator" content="TeX4ht (http://www.cse.ohio-state.edu/~gurari/TeX4ht/)"> 
<meta name="originator" content="TeX4ht (http://www.cse.ohio-state.edu/~gurari/TeX4ht/)"> 
<!-- html,mouseover,next,frames,2,no-DOCTYPE --> 
<meta name="src" content="tutorial.tex"> 
<meta name="date" content="2013-05-05 19:39:00"> 
<link rel="stylesheet" type="text/css" href="tutorial.css"> 
<script type="text/javascript" src="tutorial-js.js"></script> 
<script type="text/javascript" src="overlib.js"><!-- overLIB (c) Erik Bosrup --></script> <!--http://www.bosrup.com/web/overlib/--></head><body 
><div id="overDiv" style="position:absolute; visibility:hidden; z-index:1000;"></div> 
   <!--l. 80--><div class="crosslinks"><p class="noindent">[<a 
href="tutorialch2.html" >next</a>] [<a 
href="tutorialpa1.html" >prev</a>] [<a 
href="tutorialpa1.html#tailtutorialpa1.html" >prev-tail</a>] [<a 
href="#tailtutorialch1.html">tail</a>] [<a 
href="tutorialpa1.html#tutorialch1.html" >up</a>] </p></div>
   <h2 class="chapterHead"><span class="titlemark">Chapter&#x00A0;1</span><br /><a 
 id="x5-30001"></a>&#50756;&#51204; &#52488;&#48372;&#50640;&#50836;</h2>
<!--l. 82--><p class="noindent" >&#51060; &#47928;&#49436;&#50640;&#49436; &#8220;&#52488;&#48372;&#8221;&#46972;&#45716; &#51032;&#48120;&#45716; &#50500;&#47000;&#50640; &#45208;&#50676;&#46108; &#49324;&#54637;&#46308;&#51473; &#46160; &#44032;&#51648; &#51060;&#49345;&#50640; &#54644;&#45817;&#46104;&#49884;&#45716; &#48516;&#46308;&#51012; &#51032;&#48120;&#54633;&#45768;&#45796;.
     <ul class="itemize1">
     <li class="itemize">R &#51060;&#46972;&#45716; &#54532;&#47196;&#44536;&#47000;&#48141; &#50616;&#50612; &#51060;&#51204;&#50640; &#45796;&#47480; &#54532;&#47196;&#44536;&#47000;&#48141; &#50616;&#50612;&#50640; &#45824;&#54620; &#44221;&#54744;&#51060; &#51204;&#47924;&#54616;&#49888; &#48516;,
     </li>
     <li class="itemize">&#50976;&#45769;&#49828;&#50752; &#47532;&#45573;&#49828; &#49884;&#49828;&#53596;&#50640; &#51061;&#49689;&#54616;&#51648; &#50506;&#51004;&#49888; &#48516;,
     </li>
     <li class="itemize">&#44592;&#52488; &#53685;&#44228; &#48516;&#49437;&#50640; &#45824;&#54620; &#46020;&#50880;&#51060; &#54596;&#50836;&#54616;&#49888; &#48516;,
     </li>
     <li class="itemize">&#44536;&#45285; &#47924;&#50631;&#51012; &#54644;&#50556;&#54624;&#51648; &#47561;&#47561;&#54632;&#50640; &#49939;&#50668; &#44228;&#49888;&#48516;</li></ul>
<!--l. 91--><p class="indent" >   &#51060;&#50640; &#54644;&#45817;&#54616;&#49884;&#45716; &#48516;&#46308;&#51008; &#44845; &#8220;&#49324;&#50857;&#51204; &#48152;&#46300;&#49884; &#50508;&#50500;&#50556; &#54624; 7&#44032;&#51648; &#49689;&#51648;&#49324;&#54637;&#8221; &#49465;&#49496;&#51012; &#44845; &#51069;&#50612;&#51452;&#49884;&#44600; &#48512;&#53441;&#46300;&#47549;&#45768;&#45796;. R&#51012; &#49324;&#50857;&#54616;&#49884;&#45716;&#45936; &#51080;&#50612; &#49689;&#51648;&#49324;&#54637;&#51032; &#45236;&#50857;&#51012; &#44592;&#50613;&#54616;&#49888;&#45796;&#47732;, &#47588;&#50864; &#46020;&#50880;&#51060; &#46112; &#44163;&#51077;&#45768;&#45796;.
   <h3 class="sectionHead"><span class="titlemark">1.1   </span> <a 
 id="x5-40001.1"></a>&#44845; &#47676;&#51200; &#50508;&#50500;&#50556; &#54624; 7&#44032;&#51648;</h3>
<!--l. 98--><p class="noindent" >&#52488;&#48372;&#46972;&#44256; &#49373;&#44033;&#54616;&#49884;&#45716; &#48516;&#46308;&#44760;&#49436;&#45716; &#50500;&#47000;&#51032; &#45236;&#50857;&#46308;&#50640; &#48120;&#47532; &#50508;&#44256; &#44228;&#49884;&#47732; R&#51012; &#49324;&#50857;&#54616;&#45716;&#45936; &#46020;&#50880;&#51060; &#46121;&#45768;&#45796;.
<!--l. 101--><p class="indent" >
     <dl class="enumerate"><dt class="enumerate">
  1. </dt><dd 
class="enumerate">&#45936;&#51060;&#53552; &#51077;&#47141;&#44284; &#52376;&#47532;<span 
class="aebx-10">: </span>R &#50640;&#49436;&#45716; &#51060;&#50857;&#46104;&#45716; &#47784;&#46304; &#45936;&#51060;&#53552;&#46308;&#50640; &#45824;&#54620; &#52376;&#47532;&#45716; &#50676;&#48169;&#54693;&#51004;&#47196; &#51060;&#47336;&#50612;&#51665;&#45768;&#45796;. &#51060; &#47568;&#51032; &#46907;&#51008; &#45936;&#51060;&#53552;&#51032; &#51077;&#47141; &#48143; &#48320;&#54805;, &#44536;&#47532;&#44256; &#50672;&#49328;&#50640; &#49324;&#50857;&#46104;&#45716; &#45936;&#51060;&#53552;&#46308;&#50640; &#45824;&#54620; &#52376;&#47532;&#49692;&#49436;&#45716; &#50676;&#48169;&#54693;&#51004;&#47196; &#45208;&#50676;&#46108; &#54980;&#50640; &#51060;&#47336;&#50612;&#51648;&#45716; &#44163;&#51012; &#47568;&#54633;&#45768;&#45796;. &#50696;&#47484;&#46308;&#50612;, 1&#48512;&#53552; 12&#44620;&#51648; 12&#44060;&#51032; &#51221;&#49688;&#47196; &#51060;&#47336;&#50612;&#51652; &#49688;&#50676; (&#51593;, <span 
class="cmsy-10">{</span><span 
class="cmr-10">1</span><span 
class="cmmi-10">,</span><span 
class="cmr-10">2</span><span 
class="cmmi-10">,</span><span 
class="cmr-10">3</span><span 
class="cmmi-10">,</span><span 
class="cmr-10">4</span><span 
class="cmmi-10">,</span><span 
class="cmr-10">5</span><span 
class="cmmi-10">,</span><span 
class="cmr-10">6</span><span 
class="cmmi-10">,</span><span 
class="cmr-10">7</span><span 
class="cmmi-10">,</span><span 
class="cmr-10">8</span><span 
class="cmmi-10">,</span><span 
class="cmr-10">9</span><span 
class="cmmi-10">,</span><span 
class="cmr-10">10</span><span 
class="cmmi-10">,</span><span 
class="cmr-10">11</span><span 
class="cmmi-10">,</span><span 
class="cmr-10">12</span><span 
class="cmsy-10">}</span>)&#51012; &#49688;&#54617;&#51201;&#51064; &#54364;&#54788;&#51004;&#47196; 4&#54665; 3&#50676;&#51032; &#54665;&#47148;&#51008; R&#51008; &#50500;&#47000;&#50752; &#44057;&#51060; &#51060;&#54644;&#54633;&#45768;&#45796;.
     <!--l. 115--><p class="noindent" >
     <div class="fancyvrb" id="fancyvrb1"><a 
 id="x5-4003r1"></a><span 
class="aett-10">&#x00A0;</span><span 
class="aett-10">&#x00A0;1</span><span 
class="aett-10">&#x00A0;</span><span 
class="aett-10">&#x00A0;5</span><span 
class="aett-10">&#x00A0;</span><span 
class="aett-10">&#x00A0;</span><span 
class="aett-10">&#x00A0;9</span><br class="fancyvrb" /><a 
 id="x5-4005r2"></a><span 
class="aett-10">&#x00A0;</span><span 
class="aett-10">&#x00A0;2</span><span 
class="aett-10">&#x00A0;</span><span 
class="aett-10">&#x00A0;6</span><span 
class="aett-10">&#x00A0;</span><span 
class="aett-10">&#x00A0;10</span><br class="fancyvrb" /><a 
 id="x5-4007r3"></a><span 
class="aett-10">&#x00A0;</span><span 
class="aett-10">&#x00A0;3</span><span 
class="aett-10">&#x00A0;</span><span 
class="aett-10">&#x00A0;7</span><span 
class="aett-10">&#x00A0;</span><span 
class="aett-10">&#x00A0;11</span><br class="fancyvrb" /><a 
 id="x5-4009r4"></a><span 
class="aett-10">&#x00A0;</span><span 
class="aett-10">&#x00A0;4</span><span 
class="aett-10">&#x00A0;</span><span 
class="aett-10">&#x00A0;8</span><span 
class="aett-10">&#x00A0;</span><span 
class="aett-10">&#x00A0;12</span></div>
     <!--l. 123--><p class="noindent" >&#46384;&#46972;&#49436;, &#51060; &#54665;&#47148;&#50640;&#49436; 5&#46972;&#45716; &#49707;&#51088;&#44050;&#51008; &#54665;&#47148;&#51032; 1&#54665; 2&#50676;&#50640; &#50948;&#52824;&#54616;&#44256; &#51080;&#45796;&#44256; &#54624; &#49688; &#51080;&#51004;&#47728;, &#54665;&#47148;&#51032; 5&#48264;&#51704;&#51032; &#44050;&#51060;&#46972;&#44256;&#46020; &#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.
     </dd><dt class="enumerate">
  2. </dt><dd 
class="enumerate">&#45824;&#54868;&#49885; &#49324;&#50857;&#44284; &#44208;&#44284;&#47484; &#48372;&#45716; &#48169;&#48277;&#50640; &#45824;&#54644;&#49436;<span 
class="aebx-10">: </span>R&#51008; &#49324;&#50857;&#51088;&#44032; &#51452;&#50612;&#51648;&#45716; &#50629;&#47924;&#47484; &#49884;&#53412;&#45716; &#45824;&#47196;&#47564; &#49688;&#54665;&#54616;&#45716; &#50976;&#50857;&#54620; &#54532;&#47196;&#44536;&#47016;&#51068;&#49104;, &#44536; &#51060;&#49345;&#51032; &#45236;&#50857;&#51008; &#49688;&#54665;&#54616;&#51648; &#50506;&#45716;&#45796;&#45716; &#51216;&#51012; &#48152;&#46300;&#49884; &#47749;&#49900;&#54616;&#49492;&#50556; &#54633;&#45768;&#45796;. &#46384;&#46972;&#49436;, R &#54532;&#47196;&#44536;&#47016;&#51012; &#49884;&#51089;&#54616;&#44172; &#46104;&#47732; &#50500;&#47000;&#50752; &#44057;&#51008; &#44592;&#54840;&#47196; &#54364;&#49884;&#46104;&#45716; &#54532;&#47212;&#54532;&#53944; (&#51593;, &#49324;&#50857;&#51088;&#51032; &#47749;&#47161;&#50612;&#47484; &#44592;&#45796;&#47532;&#45716; &#44592;&#54840;)&#47484; &#48372;&#50668;&#51452;&#44172; &#46121;&#45768;&#45796;.
     <div class="fancyvrb" id="fancyvrb2"><a 
 id="x5-4012r1"></a><span 
class="aett-10">&#x00A0;</span><span 
class="aett-10">&#x00A0;&#x003E;</span></div>
     <!--l. 133--><p class="noindent" >&#47784;&#46304; &#47749;&#47161;&#50612;&#45716; <span 
class="cmmi-10">&#x003E; </span>&#44592;&#54840; &#46244;&#50640; &#51089;&#49457;&#54616;&#44172; &#46121;&#45768;&#45796;.
     <!--l. 135--><p class="noindent" >&#44032;&#51109; &#51473;&#50836;&#54620; &#44163;&#51008; &#48516;&#49437;&#51088;&#44032; &#47672;&#47551;&#49549;&#51004;&#47196; &#49345;&#49345;&#54616;&#44144;&#45208; &#44592;&#45824;&#54616;&#45716; &#50629;&#47924;&#44032; &#51080;&#45796;&#47732;, &#48516;&#49437;&#51088;&#45716; &#48152;&#46300;&#49884; &#44536; &#50629;&#47924;&#44032; &#51060;&#47336;&#50612;&#51648;&#45716; &#54532;&#47196;&#49464;&#49828;&#50640; &#45824;&#54644;&#49436; &#51096; &#50508;&#44256; &#51080;&#50612;&#50556; &#54633;&#45768;&#45796;. &#46384;&#46972;&#49436;, R&#51008; &#45796;&#47480; &#53685;&#44228; &#49548;&#54532;&#53944;&#50920;&#50612;&#46308;&#44284; &#44057;&#51060; &#48516;&#49437;&#46108; &#44208;&#44284;&#47484; &#48120;&#47532; &#48372;&#50668;&#51452;&#44144;&#45208; &#54841;&#51008; &#48516;&#49437;&#51060; &#46108; &#47784;&#46304; &#44208;&#44284;&#47484; &#54620; &#48264;&#50640; &#45796; &#48372;&#50668;&#51452;&#51648; &#50506;&#49845;&#45768;&#45796;. &#48516;&#49437;&#51088;&#44032; &#54869;&#51064;&#54616;&#44256;&#51088; &#54616;&#45716; &#44208;&#44284;&#47484; R&#50640;&#49436; &#51228;&#44277;&#54616;&#45716; &#54632;&#49688;&#47484; &#53685;&#54616;&#50668; &#51473;&#44036; &#44208;&#44284;&#47932;&#46308;&#51012; &#54869;&#51064;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#50864;&#47532;&#45716; &#48516;&#49437;&#51088;&#44032; &#51089;&#50629;&#51012; &#50612;&#46523;&#44172; &#51652;&#54665;&#54616;&#44256; &#54869;&#51064;&#54624; &#44163;&#51064;&#44032;&#50640; &#45824;&#54620; &#54532;&#47196;&#49464;&#49828; &#52264;&#53944;&#47484; &#47676;&#51200; &#51089;&#49457;&#54620;&#46244; &#48516;&#49437;&#51012; &#49688;&#54665;&#54616;&#44592;&#47484; &#44428;&#51109;&#54633;&#45768;&#45796;.
     </dd><dt class="enumerate">
  3. </dt><dd 
class="enumerate">&#53685;&#44228;&#48516;&#49437;&#51032; &#51208;&#52264;<span 
class="aebx-10">: </span>&#48516;&#49437;&#51060;&#46972; &#44163;&#51008; &#45936;&#51060;&#53552;&#50640; &#45824;&#54620; &#51060;&#54644;&#47484; &#53685;&#54616;&#50668; &#45936;&#51060;&#53552;&#44032; &#44032;&#51652; &#53945;&#51669;&#51012; &#49688;&#54617;&#51201; &#54364;&#54788;&#51004;&#47196;&#49436; &#49444;&#47749;&#54616;&#44592; &#50948;&#54620; &#44284;&#51221;&#51077;&#45768;&#45796;. &#46384;&#46972;&#49436;, &#45936;&#51060;&#53552;&#50640; &#45824;&#54620; &#51649;&#44288;&#51201;&#51064; &#51060;&#54644;&#47484; &#50948;&#54644;&#49436; &#49884;&#44033;&#54868; &#51089;&#50629;&#44284; &#53685;&#44228; &#47784;&#54805;&#51060; &#50836;&#44396;&#54616;&#45716; &#45936;&#51060;&#53552; &#54805;&#49885;&#51012; &#47564;&#46300;&#45716; &#44163;&#51060; &#51473;&#50836;&#54633;&#45768;&#45796;. &#51060;&#47484; &#51204;&#52376;&#47532; &#44284;&#51221;&#51060;&#46972;&#44256; &#54616;&#47728;, &#53685;&#44228;&#48516;&#49437;&#51008; &#53356;&#44172; &#50500;&#47000;&#50752; &#44057;&#51008; &#51208;&#52264;&#47484; &#48159;&#50500; &#51060;&#47336;&#50612;&#51665;&#45768;&#45796;.
         <ul class="itemize1">
         <li class="itemize">&#45936;&#51060;&#53552; &#51077;&#52636;&#47141;&#44284; &#53364;&#47532;&#45789;, &#44536;&#47532;&#44256; &#48516;&#49437; &#51204;&#52376;&#47532; &#44288;&#47144; &#53580;&#53356;&#45769;&#46308;
         </li>
         <li class="itemize">&#48516;&#49437;&#51204; &#53456;&#49353;&#51201; &#49884;&#44033;&#54868; &#51089;&#50629;
         </li>
         <li class="itemize">&#53685;&#44228;&#47784;&#54805;&#51032; &#44208;&#51221; &#48143; &#51201;&#50857;
         </li>
         <li class="itemize">&#47784;&#54805; &#51201;&#50857; &#54980;&#51032; &#48372;&#44256;&#49436; &#49373;&#49457; &#48143; &#49884;&#44033;&#54868; &#51089;&#50629;
         </li>
         <li class="itemize">&#53685;&#44228; &#47784;&#54805; &#51088;&#52404;&#51032; &#44060;&#48156; &#46608;&#45716; &#51088;&#46041;&#54868; &#49884;&#49828;&#53596; &#44396;&#52629;</li></ul>
                                                                                         
                                                                                         
     <!--l. 153--><p class="noindent" >&#46384;&#46972;&#49436;, &#51060; &#47928;&#49436;&#45716; &#50948;&#50640;&#49436; &#49444;&#47749;&#54620; &#44284;&#51221;&#50640; &#54644;&#45817;&#54616;&#45716; &#49692;&#49436;&#45824;&#47196; &#52309;&#53552;&#46308;&#51012; &#44396;&#49457;&#54616;&#50688;&#49845;&#45768;&#45796;.
     </dd><dt class="enumerate">
  4. </dt><dd 
class="enumerate">&#54620;&#44544; &#54364;&#54788;&#44284; &#51064;&#53076;&#46377;&#50640; &#44288;&#47144;&#54616;&#50668;<span 
class="aebx-10">:</span>
     <!--l. 159--><p class="noindent" ><span 
class="aett-10">R</span>&#51008; &#54620;&#44397;&#50612; &#49324;&#50857;&#51088;&#47484; &#50948;&#54620; &#54620;&#44397;&#50612; &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#51648;&#50896;&#54616;&#44256; &#51080;&#49845;&#45768;&#45796;. &#44536;&#47084;&#45208;<span 
class="aebx-10">, </span>&#49324;&#50857;&#51088;&#45716; &#51060;&#47084;&#54620; &#54620;&#44397;&#50612; &#51648;&#50896;&#51060; &#45800;&#49692;&#55176; &#49324;&#50857;&#51088;&#51032; &#54200;&#51032;&#47484; &#50948;&#54620; &#49440;&#53469;&#51201; &#49324;&#54637;&#51060;&#46972;&#45716; &#51216;&#51012; &#48152;&#46300;&#49884; &#50508;&#44256; &#51080;&#50612;&#50556; &#54633;&#45768;&#45796;. &#46608;&#54620;, &#48516;&#49437;&#49884; &#48376;&#47000;&#51032; &#51221;&#44368;&#54620; &#54364;&#54788;&#51008; &#48264;&#50669;&#46108; &#54620;&#44397;&#50612; &#48372;&#45796;&#45716; &#50896;&#47000;&#51032; &#50689;&#47928;&#51060;&#46972;&#45716; &#51216;&#46020; &#51082;&#51648; &#47560;&#49492;&#50556; &#54633;&#45768;&#45796;.
     <!--l. 163--><p class="noindent" >&#54788;&#51116; &#54620;&#44397;&#50612;&#50640; &#44288;&#47144;&#46108; &#51089;&#50629;&#51008; UTF-8&#51060;&#46972;&#45716; &#51064;&#53076;&#46377;&#50640; &#44592;&#48152;&#54616;&#50668; &#54620;&#44397;&#50612; &#54408;&#51656;&#44288;&#47532; &#54532;&#47196;&#44536;&#47016; (<a 
href="http://ihelp.r-forge.r-project.org/lang_msg.html" class="url" ><span 
class="aett-10">http://ihelp.r-forge.r-project.org/lang_msg.html</span></a>)&#51012; &#53685;&#54616;&#50668; &#51060;&#47336;&#50612; &#51648;&#44256; &#51080;&#51004;&#45208;, <span 
class="aett-10">R</span>&#51012; &#54620;&#44397;&#50612;&#44032; &#50500;&#45772; &#50689;&#47928;&#51004;&#47196; &#49444;&#51221;&#54616;&#44592; &#50948;&#54644;&#49436;&#45716; &#45796;&#51020;&#51032; &#51452;&#49548;&#47484; &#45580;&#47084; &#44536; &#45236;&#50857;&#51012; &#54869;&#51064;&#54644;&#51452;&#49884;&#44600; &#48512;&#53441;&#46300;&#47549;&#45768;&#45796;. &#51060; &#45236;&#50857;&#51008; &#48260;&#51204;&#50640; &#44288;&#44228;&#50630;&#51060; &#51068;&#48152;&#51201;&#51004;&#47196; &#53685;&#50857;&#46104;&#45716; &#48169;&#48277;&#51060;&#45208; &#50952;&#46020;&#50864;&#51592; &#49324;&#50857;&#51088;&#50640;&#44172; &#47582;&#52628;&#50612;
     &#51089;&#49457;&#46104;&#50632;&#49845;&#45768;&#45796;.
     <!--l. 166--><p class="noindent" ><a 
href="http://lists.r-forge.r-project.org/pipermail/ihelp-urquestion/2013-April/000003.html" class="url" ><span 
class="aett-10">http://lists.r-forge.r-project.org/pipermail/ihelp-urquestion/2013-April/000003.html</span></a>
     <!--l. 168--><p class="noindent" >&#48376;&#47000; &#45936;&#51060;&#53552;&#47484; &#51088;&#44397;&#51032; &#50616;&#50612;&#47196; &#54364;&#54788;&#54616;&#45716; &#48169;&#48277;&#51008; UTF-8 &#51060;&#46972;&#45716; &#51064;&#53076;&#46377;&#51012; &#51060;&#50857;&#54616;&#48064;&#47196;, &#44036;&#54841; &#45936;&#51060;&#53552;&#44032; &#50732;&#48148;&#47476;&#44172; &#48372;&#51060;&#51648; &#50506;&#51012; &#44221;&#50864;&#44032; &#51080;&#49845;&#45768;&#45796;. &#51060;&#47084;&#54620; &#47928;&#51228;&#47484; &#54644;&#44208;&#54616;&#44592; &#50948;&#54644;&#49436;&#45716; &#8220;R&#51012; &#51648;&#50896;&#54616;&#45716; &#51064;&#53076;&#46377; &#51473; &#50732;&#48148;&#47476;&#44172; &#54620;&#44397;&#50612;&#47484; &#54364;&#54788;&#54644;&#51452;&#45716; &#53076;&#46300;&#47484; &#52286;&#45716; &#48169;&#48277;&#8221; (<a 
href="http://lists.r-forge.r-project.org/pipermail/ihelp-urquestion/2013-April/000017.html" class="url" ><span 
class="aett-10">http://lists.r-forge.r-project.org/pipermail/ihelp-urquestion/2013-April/000017.html</span></a>)
     &#47484; &#51069;&#50612;&#48372;&#49884;&#44600; &#48148;&#46989;&#45768;&#45796;.
     <!--l. 171--><p class="noindent" >&#44036;&#54841;, &#51096;&#47803;&#46108; &#54620;&#44544;&#52376;&#47532;&#44032; &#49884;&#49828;&#53596; &#50640;&#47084;&#47484; &#50556;&#44592;&#54616;&#45716; &#44221;&#50864;&#44032; &#51080;&#51004;&#48064;&#47196;, &#51060;&#47084;&#54620; &#44221;&#50864;&#50640; &#54620;&#44397;&#50612;&#47196; R&#51012; &#49324;&#50857;&#54616;&#49884;&#45716; &#48516;&#46308;&#44760;&#49436;&#45716; &#45796;&#49548; &#48264;&#44144;&#47196;&#50864;&#49892;&#51648;&#46972;&#46020; &#48372;&#45796; &#50504;&#51221;&#51201;&#51060;&#44256; &#45208;&#51008; R&#51012; &#51228;&#44277;&#54616;&#44592; &#50948;&#54616;&#50668; &#44536; &#45236;&#50857;&#51012; <a 
href="mailto:ihelp-urquestion@lists.r-forge.r-project.org" >ihelp-urquestion@lists.r-forge.r-project.org</a> &#51452;&#49548;&#47196; &#51060;&#47700;&#51068;&#51012; &#48372;&#45236;&#51452;&#49888;&#45796;&#47732; &#44048;&#49324;&#54616;&#44192;&#49845;&#45768;&#45796;.
     <!--l. 173--><p class="noindent" >&#45800;, &#51060;&#47084;&#54620; &#54620;&#44544;&#52376;&#47532;&#45716; &#48516;&#49437;&#50640; &#50672;&#44288;&#46108; &#49688;&#52824;&#50672;&#49328;&#44284;&#45716; &#50500;&#47924;&#47088; &#44288;&#44228;&#44032; &#50630;&#51020;&#51012; &#48152;&#46300;&#49884; &#50508;&#50500;&#51452;&#49884;&#44600; &#48512;&#53441;&#46300;&#47549;&#45768;&#45796;.
     </dd><dt class="enumerate">
  5. </dt><dd 
class="enumerate">&#45824;&#49548;&#47928;&#51088; &#44396;&#48516;&#50640; &#44288;&#47144;&#54616;&#50668;<span 
class="aebx-10">: </span>&#47566;&#51008; &#48516;&#46308;&#51060; &#51060;&#51204;&#50640; SAS &#49548;&#54532;&#53944;&#50920;&#50612;&#47484; &#49324;&#50857;&#54616;&#50668; &#48516;&#49437;&#51012; &#49688;&#54665;&#54616;&#49512;&#51012; &#44163;&#51077;&#45768;&#45796;. SAS&#50640;&#49436;&#45716; &#45824;&#49548;&#47928;&#51088;&#47484; &#44396;&#48516;&#54616;&#51648; &#50506;&#44256; &#54532;&#47196;&#44536;&#47016;&#51012; &#51089;&#49457;&#54616;&#44172; &#46104;&#51648;&#47564;, R&#50640;&#49436;&#45716; &#45824;&#49548;&#47928;&#51088;&#47484; &#44396;&#48516;&#54616;&#48064;&#47196; A &#46972;&#45716; &#48320;&#49688;&#50752; a &#46972;&#45716; &#48320;&#49688;&#45716; &#49436;&#47196; &#45796;&#47480; &#44163;&#51076;&#51012; &#47749;&#49900;&#54616;&#49884;&#44600; &#48512;&#53441;&#46300;&#47549;&#45768;&#45796;.
     </dd><dt class="enumerate">
  6. </dt><dd 
class="enumerate">&#50868;&#50689;&#52404;&#51228;&#50752; &#44288;&#47144;&#54616;&#50668;<span 
class="aebx-10">: </span>R&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; Unix (&#50976;&#45769;&#49828;)&#50752; &#44057;&#51008; &#54872;&#44221;&#50640;&#49436; &#51089;&#49457;&#46104;&#50632;&#49845;&#45768;&#45796;.
     </dd><dt class="enumerate">
  7. </dt><dd 
class="enumerate">&#54056;&#53412;&#51648;&#50752; &#44288;&#47144;&#54616;&#50668;<span 
class="aebx-10">:  </span>R&#51008; Add-on&#51060;&#46972;&#45716; &#54056;&#53412;&#51648; &#49884;&#49828;&#53596;&#51012; &#51060;&#50857;&#54633;&#45768;&#45796;. &#51060;&#44163;&#51008; &#44592;&#48376; &#48288;&#51060;&#49828; &#49884;&#49828;&#53596;&#50640; &#52628;&#44032;&#47196; &#54596;&#50836;&#54620; &#44592;&#45733;&#46308;&#51012; &#52628;&#44032;&#54616;&#45716; &#51032;&#48120;&#51077;&#45768;&#45796;. &#51060;&#47084;&#54620; &#45236;&#50857;&#51012; &#51096; &#47784;&#47476;&#45716; &#49345;&#53468;&#50640;&#49436; &#52488;&#48372;&#51088;&#44032; &#44032;&#51109; &#47566;&#51060; &#44202;&#45716; &#49892;&#49688;&#45716; &#50612;&#46500; &#54632;&#49688;&#47484; &#49324;&#50857;&#54616;&#44256;&#51088; &#54624; &#46412; &#8220;xxx &#54632;&#49688;&#44032; &#50630;&#49845;&#45768;&#45796;&#8221; &#46608;&#45716; &#8220;xxx &#54632;&#49688;&#47484; &#52286;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;&#8221;&#51077;&#45768;&#45796;. &#51060;&#45716; &#49324;&#50857;&#54616;&#44256;&#51088; &#54616;&#45716; &#54632;&#49688;&#44032; R &#44592;&#48376; &#48176;&#54252;&#54032;&#50640; &#54252;&#54632;&#46104;&#50612; &#51080;&#51648; &#50506;&#51008; &#50612;&#46500; &#49324;&#50857;&#51088;&#50640; &#51032;&#54644;&#49436; &#51228;&#44277;&#46108; &#53945;&#51221;&#54620; &#54056;&#53412;&#51648;&#45236;&#50640;&#49436; &#51316;&#51116;&#54616;&#44592; &#46412;&#47928;&#51077;&#45768;&#45796;. &#51060;&#47088; &#44221;&#50864;&#50640;&#45716; &#47676;&#51200; &#49324;&#50857;&#54616;&#44256;&#51088; &#54616;&#45716; &#54632;&#49688;&#44032; &#50612;&#46500; &#54056;&#53412;&#51648;&#50640; &#51316;&#51116;&#54616;&#45716;&#51648; &#50508;&#50500;&#50556; &#54633;&#45768;&#45796;. &#44536;&#47532;&#44256;, &#54644;&#45817; &#54056;&#53412;&#51648;&#47484; &#49444;&#52824;&#54664;&#51012; &#46412;&#50640;&#45716; &#49444;&#52824;&#46108; &#54056;&#53412;&#51648;&#47484; &#49324;&#50857;&#54624; &#49688; &#51080;&#46020;&#47197; &#47196;&#46377;&#54616;&#45716; &#44284;&#51221;&#51012; &#44144;&#52432;&#50556;
     &#54633;&#45768;&#45796;.
     <!--l. 194--><p class="noindent" >
     <div class="fancyvrb" id="fancyvrb3"><a 
 id="x5-4019r1"></a><span 
class="aett-10">&#x00A0;</span><span 
class="aett-10">&#x00A0;&#x003E;</span><span 
class="aett-10">&#x00A0;library(pkg_name)</span></div>
     <!--l. 199--><p class="noindent" >&#54056;&#53412;&#51648;&#51032; &#49444;&#52824;, &#54869;&#51064;&#50640; &#44288;&#47144;&#46108; &#49324;&#54637;&#51008; &#8220;&#53685;&#44228;&#47784;&#54805;&#51032; &#49440;&#53469;&#44284; &#51201;&#50857;&#8221;&#51060;&#46972;&#45716; &#52309;&#53552;&#50640; &#44592;&#47197;&#54644;&#46160;&#50632;&#49845;&#45768;&#45796;.
     </dd></dl>
<!--l. 206--><p class="noindent" >
   <h3 class="sectionHead"><span class="titlemark">1.2   </span> <a 
 id="x5-50001.2"></a>&#50780; R&#51012; &#49324;&#50857;&#54616;&#45208;&#50836;?</h3>
<!--l. 208--><p class="noindent" >R&#51012; &#49324;&#50857;&#54616;&#45716; &#51060;&#50976;&#45716; &#50500;&#47560;&#46020; &#50500;&#47000;&#50752; &#44057;&#51008; &#51060;&#50976;&#51060;&#44592; &#46412;&#47928;&#51077;&#45768;&#45796;. (R Documentation&#50640;&#45716; &#50630;&#45716; &#51060; &#47928;&#49436;&#51032; &#51648;&#51008;&#51060; &#44060;&#51064;&#51032; &#49373;&#44033;&#51076;&#51012; &#47749;&#49900;&#54616;&#49884;&#44600; &#48148;&#46989;&#45768;&#45796;)
<!--l. 212--><p class="indent" >
     <dl class="enumerate"><dt class="enumerate">
  1. </dt><dd 
class="enumerate">R&#51008; &#47588;&#50864; &#45796;&#50577;&#54620; &#48516;&#50556;&#50640;&#49436; &#44060;&#48156;&#46104;&#44256; &#51201;&#50857;&#46104;&#45716; &#52572;&#49888; &#53685;&#44228;&#44592;&#48277;&#51012; &#51201;&#50857;&#54624; &#49688; &#51080;&#45716; &#51088;&#50976;&#49548;&#54532;&#53944;&#50920;&#50612;&#51060;&#44592; &#46412;&#47928;&#51077;&#45768;&#45796;.
     </dd><dt class="enumerate">
  2. </dt><dd 
class="enumerate">&#54665;&#47148;&#44592;&#48152;&#51032; &#44061;&#52404;&#51648;&#54693;&#51201; &#54532;&#47196;&#44536;&#47000;&#48141; &#50616;&#50612;&#51060;&#44592; &#46412;&#47928;&#51077;&#45768;&#45796;.
     </dd><dt class="enumerate">
  3. </dt><dd 
class="enumerate">&#45796;&#47480; &#49548;&#54532;&#53944;&#50920;&#50612;&#46308;&#50640; &#48708;&#44368;&#54616;&#50668; &#47928;&#48277;&#51201; &#49324;&#50857;&#51032; &#51088;&#50976;&#47213;&#44592; &#46412;&#47928;&#51068; &#44163;&#51077;&#45768;&#45796;.</dd></dl>
                                                                                         
                                                                                         
<!--l. 218--><p class="noindent" >
   <h3 class="sectionHead"><span class="titlemark">1.3   </span> <a 
 id="x5-60001.3"></a>&#53685;&#44228;&#49548;&#54532;&#53944;&#50920;&#50612;&#51032; &#51333;&#47448;</h3>
<!--l. 220--><p class="noindent" >R&#51060;&#46972;&#45716; &#53685;&#44228;&#49548;&#54532;&#53944;&#50920;&#50612;&#47484; &#45824;&#52404;&#54624; &#49688; &#51080;&#45716; &#45796;&#47480; &#49548;&#54532;&#53944;&#50920;&#50612;&#46308;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.
     <ul class="itemize1">
     <li class="itemize">S-PLUS (&#49345;&#50629;&#50857; &#48260;&#51204;&#51032; S &#50616;&#50612; &#49548;&#54532;&#53944;&#50920;&#50612;)
     </li>
     <li class="itemize">MATLAB (R&#44284; &#44057;&#51008; &#54665;&#47148;&#44592;&#48152;&#51032; &#50616;&#50612;)
     </li>
     <li class="itemize">SPSS
     </li>
     <li class="itemize">Octave (MATLAB&#51032; GNU &#48260;&#51204;)
     </li>
     <li class="itemize">Python (&#54532;&#47196;&#44536;&#47000;&#48141; &#50616;&#50612;)
     </li>
     <li class="itemize">SAS
     </li>
     <li class="itemize">STATA</li></ul>
                                                                                         
                                                                                         
   <!--l. 242--><div class="crosslinks"><p class="noindent">[<a 
href="tutorialch2.html" >next</a>] [<a 
href="tutorialpa1.html" >prev</a>] [<a 
href="tutorialpa1.html#tailtutorialpa1.html" >prev-tail</a>] [<a 
href="tutorialch1.html" >front</a>] [<a 
href="tutorialpa1.html#tutorialch1.html" >up</a>] </p></div>
<!--l. 242--><p class="indent" >   <a 
 id="tailtutorialch1.html"></a>    
</body></html> 
