<html > 
<head><title>10  </title> 
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1"> 
<meta name="generator" content="TeX4ht (http://www.cse.ohio-state.edu/~gurari/TeX4ht/)"> 
<meta name="originator" content="TeX4ht (http://www.cse.ohio-state.edu/~gurari/TeX4ht/)"> 
<!-- html,mouseover,next,frames,2,no-DOCTYPE --> 
<meta name="src" content="tutorial.tex"> 
<meta name="date" content="2013-05-05 20:18:00"> 
<link rel="stylesheet" type="text/css" href="tutorial.css"> 
<script type="text/javascript" src="tutorial-js.js"></script> 
<script type="text/javascript" src="overlib.js"><!-- overLIB (c) Erik Bosrup --></script> <!--http://www.bosrup.com/web/overlib/--></head><body 
><div id="overDiv" style="position:absolute; visibility:hidden; z-index:1000;"></div> 
   <!--l. 2567--><div class="crosslinks"><p class="noindent">[<a 
href="tutorialpa5.html" >next</a>] [<a 
href="tutorialch9.html" >prev</a>] [<a 
href="tutorialch9.html#tailtutorialch9.html" >prev-tail</a>] [<a 
href="#tailtutorialch10.html">tail</a>] [<a 
href="tutorialpa4.html#tutorialch10.html" >up</a>] </p></div>
   <h2 class="chapterHead"><span class="titlemark">Chapter&#x00A0;10</span><br /><a 
 id="x17-22100010"></a>&#48120;&#48516;&#47448; &#51656;&#47928;&#46308;</h2>
<!--l. 2572--><p class="noindent" >&#51060; &#49465;&#49496;&#50640; &#46321;&#47197;&#46108; &#51656;&#47928;&#46308;&#51008; &#51217;&#49688;&#47564; &#46104;&#44256; &#50500;&#51649;&#51008; &#45813;&#48320;&#46104;&#51648; &#50506;&#51008; &#49345;&#53468;&#51077;&#45768;&#45796;
     <dl class="enumerate"><dt class="enumerate">
  1. </dt><dd 
class="enumerate">(&#51217;&#49688;: 2013-APR-23) &#51228;&#44032; &#44032;&#51652; &#45936;&#51060;&#53552;&#49483;&#51060; &#51080;&#45716;&#45936;, &#51060; &#45936;&#51060;&#53552;&#47484; &#50612;&#46500; &#53945;&#51221;&#54620; &#48320;&#49688;&#46308;&#51032; &#44050;&#51012; &#51060;&#50857;&#54616;&#50668; &#48516;&#47448;&#54616;&#47140;&#44256; &#54633;&#45768;&#45796;. &#50612;&#46523;&#44172; &#54644;&#50556;&#54616;&#45208;&#50836;?
     <!--l. 2618--><p class="noindent" ><span 
class="aess-10">(</span>&#45813;&#48320;<span 
class="aess-10">) </span>&#50836;&#44163;&#51008; <span 
class="aett-10">split() </span>&#54632;&#49688;&#47484; &#51060;&#50857;&#54616;&#46020;&#47197; &#50508;&#47140;&#51460; &#44163;.
     </dd><dt class="enumerate">
  2. </dt><dd 
class="enumerate">(&#51217;&#49688;: 2013-APR-23) &#51228;&#44032; &#44032;&#51652; &#45936;&#51060;&#53552; &#54532;&#47112;&#51076;&#50640; NA &#44050;&#46308;&#51060; &#51080;&#45716;&#45936;, NA &#46412;&#47928;&#50640; &#48516;&#49437;&#51060; &#51060;&#49345;&#54644;&#51648;&#45716; &#44163; &#44057;&#50500;, NA&#47484; &#44032;&#51652; &#45936;&#51060;&#53552; &#54665;&#51088;&#52404;&#47484; &#50630;&#50528;&#44256; &#49910;&#49845;&#45768;&#45796;. &#54620;&#48264;&#50640; &#54644;&#51452;&#45716;&#44172; &#50630;&#45208;&#50836;?
     <!--l. 2622--><p class="noindent" ><span 
class="aess-10">(</span>&#45813;&#48320;<span 
class="aess-10">) </span>&#50836;&#44148; <span 
class="aett-10">na.omit()</span>&#44284; &#44057;&#51008; &#54632;&#49688;&#47484; &#51060;&#50857;&#54616;&#45716; &#48277;&#51012; &#50508;&#47140;&#51460; &#44163;. &#55136;.. <span 
class="aett-10">na.action</span>&#51060;&#46972;&#45716; &#44060;&#45392;&#51012; &#50508;&#47140;&#51452;&#47732; &#45908;&#50865; &#51339;&#51020;.
     </dd><dt class="enumerate">
  3. </dt><dd 
class="enumerate">(&#51217;&#49688;: 2013-APR-23) &#45436;&#47532;&#54805; &#48289;&#53552;&#44032; &#51080;&#45716;&#45936;, &#51060; &#48289;&#53552;&#51032; &#44396;&#49457;&#50836;&#49548;&#44032; &#47784;&#46160; TRUE &#51064;&#51648; &#50508;&#44256; &#49910;&#49845;&#45768;&#45796;.
     <!--l. 2626--><p class="noindent" ><span 
class="aess-10">(</span>&#45813;&#48320;<span 
class="aess-10">) </span>&#51060;&#44148; <span 
class="aett-10">isTRUE()</span>&#54632;&#49688;&#50752; <span 
class="aett-10">all()</span>&#54632;&#49688;&#47484; &#53685;&#54644; &#50508;&#47140;&#51452;&#47732; &#47588;&#50864; &#51339;&#51020;.
     </dd><dt class="enumerate">
  4. </dt><dd 
class="enumerate">(&#51217;&#49688;: 2013-APR-22) &#49440;&#54805;&#48169;&#51221;&#49885; <span 
class="cmmi-10">AX </span><span 
class="cmr-10">= </span><span 
class="cmmi-10">b</span>&#51032; &#54644; <span 
class="cmmi-10">X</span>&#47484; &#52286;&#51004;&#47140;&#47732; &#50612;&#46523;&#44172; &#54644;&#50556; &#54616;&#45208;&#50836;?
     <!--l. 2630--><p class="noindent" ><span 
class="aess-10">(</span>&#45813;&#48320;<span 
class="aess-10">) </span><span 
class="aett-10">solve() </span>&#54632;&#49688;&#51032; &#49324;&#50857;&#48277;&#51012; &#50508;&#47140;&#51460; &#44163;.
     </dd><dt class="enumerate">
  5. </dt><dd 
class="enumerate">(&#51217;&#49688;: 2013-APR-21) R &#54056;&#53412;&#51648;&#47484; CRAN&#50640; &#50732;&#47532;&#45716; &#48169;&#48277;&#51012; &#50508;&#47140;&#51452;&#49464;&#50836;
     <!--l. 2634--><p class="noindent" ><span 
class="aess-10">(</span>&#45813;&#48320;<span 
class="aess-10">) </span>&#51060; &#51656;&#47928;&#51012; &#45824;&#45813;&#54624; &#46412;&#45716; &#48152;&#46300;&#49884; CRAN Package Submission Guideline&#50640; &#45824;&#54644;&#49436; &#50508;&#47140;&#51480;&#50556; &#54632;. (&#51060;&#44144; &#48264;&#50669;&#54644; &#45480;&#45716;&#45936; &#45817;&#52684; &#50612;&#46356;&#50640; &#46208;&#45716;&#51648; &#52286;&#51012; &#49688;&#44032; &#50630;&#51020;, 2013-04-20 &#44620;&#51648; &#47803; &#52286;&#51004;&#47732; &#49352;&#47196;&#51060; &#48264;&#50669;&#54624; &#44163;)
     </dd><dt class="enumerate">
  6. </dt><dd 
class="enumerate">(&#51217;&#49688;: 2013-APR-19) R&#51008; &#52376;&#51020;&#48512;&#53552; &#44592;&#51316;&#51032; &#53685;&#44228;&#54057;&#53412;&#51648;&#50752;&#45716; &#45796;&#47480; &#47784;&#49845;&#50640; &#50557;&#44036; &#46160;&#47157;&#44592;&#44620;&#51648; &#54633;&#45768;&#45796;. &#44592;&#51316;&#51032; &#48516;&#49437;&#51008; &#51068;&#48152;&#51201;&#51004;&#47196; <span 
class="cmr-10">[</span>&#54532;&#47196;&#44536;&#47016; &#49892;&#54665; <span 
class="cmsy-10">- </span><span 
class="cmmi-10">&#x003E; </span>&#45936;&#51060;&#53552; &#48520;&#47084;&#50724;&#44592; <span 
class="cmsy-10">- </span><span 
class="cmmi-10">&#x003E; </span>&#48516;&#49437;(&#47700;&#45684;&#53364;&#47533;:SPSS &#46608;&#45716; &#47749;&#47161;&#50612;&#51077;&#47141;:SAS) <span 
class="cmsy-10">- </span><span 
class="cmmi-10">&#x003E; </span>&#49892;&#54665;<span 
class="cmr-10">]</span>&#51032; &#51208;&#52264;&#47484; &#48159;&#50500; &#50772;&#44592;&#50640; &#47784;&#46304; &#44208;&#44284;&#47484; &#54620; &#48264;&#50640; &#48372;&#50668;&#51452;&#45716; &#49885;&#51077;&#45768;&#45796;. &#44536;&#47084;&#45208; R&#51008; &#44536;&#47111;&#51648; &#50506;&#50500; &#51060;&#47084;&#54620; &#51216;&#48512;&#53552; &#49373;&#49548;&#54616;&#44256; &#51060;&#49345;&#54633;&#45768;&#45796;. &#45936;&#51060;&#53552;&#47484; &#48520;&#47084;&#50724;&#44592; &#54616;&#47732; &#48148;&#47196; &#45936;&#51060;&#53552;&#49884;&#53944;&#47484; &#48380; &#49688; &#51080;&#45716; &#44163;&#46020; &#50500;&#45785;&#45768;&#45796; (&#51217;&#49688;&#45216;&#51676;: 2013-APR-17).
     </dd><dt class="enumerate">
  7. </dt><dd 
class="enumerate">(&#51217;&#49688;: 2013-04-18, Reproducibility=NO) read.xlsx&#54632;&#49688;&#47484; &#51060;&#50857;&#54644; xlsx&#54028;&#51068;&#50640;&#49436; &#45936;&#51060;&#53552;&#54532;&#47112;&#51076;&#54805;&#53468;&#47196; &#44032;&#51256;&#50741;&#45768;&#45796;. &#51060; &#46412; [3,3] &#49472;&#50640; &#51080;&#45716; &#53581;&#49828;&#53944;&#44032; "3&#50900;" &#51060;&#46972;&#44256; &#54624; &#46412; temp[3,3] == "3&#50900;" &#51060;&#47111;&#44172; &#48708;&#44368;&#54616;&#47140;&#44256; &#54616;&#47732; &#51228;&#45824;&#47196; &#48708;&#44368;&#44032; &#50504;&#46104;&#45908;&#44400;&#50836;.. &#54620;&#44544; &#53581;&#49828;&#53944;&#47196; &#51060;&#47336;&#50612;&#51652; &#48320;&#49688;&#44050;&#47484; &#48708;&#44368;&#54616;&#45716; &#48169;&#48277;&#51060; &#50612;&#46500;&#44172; &#51080;&#45716;&#51648; &#44417;&#44552;&#54633;&#45768;&#45796;.
     </dd><dt class="enumerate">
  8. </dt><dd 
class="enumerate">&#48516;&#49437;&#51012; &#54616;&#44256; &#45208;&#47732; &#44208;&#44284;&#47484; &#44536;&#47000;&#54532;&#45208; &#44536;&#47548;&#51004;&#47196; &#45208;&#53440;&#45236;&#44172; &#46104;&#45716;&#45936; R&#50640;&#49436;&#45716; &#44536;&#47548;&#51012; &#45208;&#53440;&#45236;&#45716; &#52285;&#51060; &#54616;&#45208;&#47564; &#45208;&#53440;&#45208;&#49436; &#46041;&#49884;&#50640; &#46160; &#44060;&#47484; &#48372;&#51648; &#47803;&#54616;&#45716; &#44221;&#50864;&#44032; &#54728;&#45796;&#54620;&#45936;, &#51060;&#51032; &#54644;&#44208;&#48169;&#48277;&#51008; &#50630;&#45208;&#50836;? (&#51217;&#49688;: 2013-APR-13, &#48516;&#47448;: &#44536;&#47000;&#54589;&#49828; &#44288;&#47144;)
     <!--l. 2642--><p class="noindent" ><span 
class="aess-10">(</span>&#45813;&#48320;<span 
class="aess-10">) </span><span 
class="aett-10">R</span>&#50640;&#49436;&#45716; &#44536;&#47000;&#54589; &#46356;&#48148;&#51060;&#49828;&#44032; &#44536;&#47000;&#54589; &#49373;&#49457;&#49884; &#47560;&#45796; &#52488;&#44592;&#54868;&#46104;&#50612; &#45796;&#49884; &#48372;&#50668;&#51468;&#51004;&#47196;&#49436; &#44536;&#47000;&#54589; &#52285;&#51060; &#54616;&#45208;&#47564; &#44228;&#49549; &#48372;&#50668;&#51648;&#45716; &#44163;&#51077;&#45768;&#45796;. &#49352;&#47196;&#50868; &#44536;&#47000;&#54532;&#47484; &#46608;&#45796;&#47480; &#51109;&#52824;&#47484; &#53685;&#54644; &#48372;&#50668;&#51452;&#44256;&#51088; &#54620;&#45796;&#47732; <span 
class="aett-10">X11()</span>&#51060;&#46972;&#45716; &#47749;&#47161;&#50612;&#47484; &#51060;&#50857;&#54616;&#47732; &#46121;&#45768;&#45796;. &#51060; &#47749;&#47161;&#50612;&#45716; &#50976;&#45769;&#49828;&#54872;&#44221;&#50640; &#49444;&#52824;&#46108; <span 
class="aett-10">R</span>&#51032; &#44221;&#50864;&#50640; &#54644;&#45817;&#54633;&#45768;&#45796;.
     </dd></dl>
   <h3 class="sectionHead"><span class="titlemark">10.1   </span> <a 
 id="x17-22200010.1"></a>&#45813;&#48320;&#46104;&#51648; &#50506;&#51012; &#49688;&#46020; &#51080;&#45716; &#51656;&#47928;&#46308;</h3>
<!--l. 2653--><p class="noindent" >
     <dl class="enumerate"><dt class="enumerate">
  1. </dt><dd 
class="enumerate">(&#51217;&#49688;: 2013-04-18, Reproducibility=NA) R&#51032; &#51109;&#51216;&#51060;&#51088; &#45800;&#51216;&#51060;&#46972;&#44256; &#49373;&#44033;&#46104;&#45716; &#44163; &#51473;&#50640; &#54616;&#45208;&#44032; &#50628;&#52397;&#45212; &#49688;&#51032; &#54056;&#53412;&#51648;&#46308;&#51076;. &#51593; &#50612;&#46500; &#48516;&#49437;&#51012; &#54616;&#44256;&#51088; &#54624; &#46412; &#44536;&#44163;&#50640; &#45824;&#54644; &#54616;&#45208;&#51032; &#54056;&#53412;&#51648;&#44032; &#51080;&#45716; &#44163;&#51060; &#50500;&#45768;&#46972; &#45824;&#52404;&#51201;&#51004;&#47196; &#49324;&#50857;&#44032;&#45733;&#54620; &#54056;&#53412;&#51648;&#46308;&#51060; &#51316;&#51116;&#54616;&#45716;&#45936; &#51060;&#46308; &#51473; &#50612;&#45712; &#44163;&#51012; &#50024;&#50556;&#54624; &#51648; &#51096; &#47784;&#47492;. &#45796;&#47480; &#48516;&#49437; &#54532;&#47196;&#44536;&#47016;&#51032; &#44221;&#50864; &#51060;&#47084;&#54620; &#47928;&#51228;&#44032; &#50630;&#45716;&#45936;... &#44208;&#44397;&#50644; &#50612;&#46523;&#44172; &#51228;&#51068; &#49457;&#45733;&#51060; &#51339;&#51008;? &#44208;&#44284;&#44032; &#49888;&#47280;&#54624; &#47564;&#54620;? &#51339;&#51008; &#54056;&#53412;&#51648;&#47484; &#49440;&#53469;&#54616;&#45716;&#44032;&#47484; &#50508;&#47140;&#51452;&#50632;&#51004;&#47732; &#51339;&#44192;&#50432;&#46048;.
     <!--l. 2655--><p class="noindent" ><span 
class="aess-10">(</span>&#45813;&#48320;<span 
class="aess-10">) </span>&#51060;&#44163;&#51008; &#44221;&#54744;&#50640; &#54644;&#45817;&#46104;&#47728;, &#54644;&#45817;&#48516;&#50556;&#51032; &#51204;&#47928;&#44032;&#47196;&#48512;&#53552;&#51032; &#51312;&#50616;&#51012; &#48155;&#45716; &#44163;&#51060; &#50504;&#51204;&#54633;&#45768;&#45796;. &#44536;&#47111;&#51648; &#50506;&#45796;&#47732;, &#51649;&#51217; &#48288;&#51060;&#49828;&#47484; &#51060;&#50857;&#54616;&#50668; &#51089;&#49457;&#54616;&#47732; &#46121;&#45768;&#45796;.
     </dd></dl>
                                                                                         
                                                                                         
   <!--l. 2664--><div class="crosslinks"><p class="noindent">[<a 
href="tutorialpa5.html" >next</a>] [<a 
href="tutorialch9.html" >prev</a>] [<a 
href="tutorialch9.html#tailtutorialch9.html" >prev-tail</a>] [<a 
href="tutorialch10.html" >front</a>] [<a 
href="tutorialpa4.html#tutorialch10.html" >up</a>] </p></div>
<!--l. 2664--><p class="indent" >   <a 
 id="tailtutorialch10.html"></a>   
</body></html> 
